(package! banner-comment)
(package! bitwarden :recipe '(:host github :repo "seanfarley/emacs-bitwarden"))
(package! col-highlight :recipe '(:host github :repo "emacsmirror/col-highlight"))
(package! counsel-jq)
(package! counsel-world-clock)
(package! discover-my-major)
(package! dot-mode)
(package! easy-hugo)
(package! elisp-slime-nav)
(package! embrace)
(package! emr)
(package! fancy-narrow)
(package! flycheck-package)
(package! focus)
(package! goto-chg)
(package! grip-mode)
(package! ialign)
(package! lsp-focus :recipe '(:host github :repo "emacs-lsp/lsp-focus"))
(package! lsp-origami)
(package! lsp-treemacs)
(package! mu4e-alert)
(package! mu4e-patch :recipe '(:host github :repo "seanfarley/mu4e-patch"))
(package! nerd-font :recipe '(:host github :repo "twlz0ne/nerd-fonts.el"))
(package! org-noter-pdftools)
(package! org-recent-headings)
(package! org-ref)
(package! org-roam-bibtex)
(package! org-sidebar)
(package! org-web-tools)
;; (package! ox-report) ;; if I get back into contracting
(package! package-lint)
(package! page-break-lines)
;; ugh, get rid of this pipenv shit
(package! pipenv :disable t)
(package! resize-window)
(package! simple-httpd)
(package! simple-mpc)
(package! sly-quicklisp)
(package! sphinx-doc)
(package! srefactor)
(package! ssh-config-mode)
(package! sx)
(package! tree-sitter)
(package! tree-sitter-langs)
(package! unfill)
(package! webpaste)
(package! whole-line-or-region)
(package! which-key-posframe)
;; too annoying for technical writing which uses a lot of passive voice
(package! writegood-mode :disable t)
(package! xonsh-mode :recipe '(:host github :repo "seanfarley/xonsh-mode"))
(package! ztree)
(package! org-link-minor-mode :recipe '(:host github
                                        :repo "seanohalpin/org-link-minor-mode"))
