(package! ace-mc)
(package! banner-comment)
(package! bitwarden :recipe (:host github :repo "seanfarley/emacs-bitwarden"))
(package! col-highlight :recipe (:host github :repo "emacsmirror/col-highlight"))
(package! color-identifiers-mode)
(package! counsel-jq)
(package! discover-my-major)
(package! dot-mode)
(package! easy-hugo)
(package! elisp-slime-nav)
(package! embrace)
(package! emr)
(package! fancy-narrow)
(package! focus)
(package! goto-chg)
(package! ialign)
(package! jump-tree)
(package! lsp-focus :recipe (:host github :repo "emacs-lsp/lsp-focus"))
(package! lsp-origami)
(package! lsp-treemacs)
(package! mu4e-alert)
(package! mu4e-patch :recipe (:host github :repo "seanfarley/mu4e-patch"))
(package! nov)
(package! org-ref)
(package! package-lint)
(package! page-break-lines)
(package! resize-window)
(package! simple-httpd)
(package! sly-quicklisp)
(package! sphinx-doc)
(package! srefactor)
(package! sx)
(package! unfill)
(package! webpaste)
(package! whole-line-or-region)
(package! which-key-posframe)
(package! xonsh-mode :recipe (:local-repo "~/projects/xonsh-mode"))
(package! ztree)
